Revit 2024 API
BuiltInFailures.ElectricityFailures Class
 Failures related to electrical system and circuits.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ElectricityFailures
Visual Basic
Public NotInheritable Class ElectricityFailures
Visual C++
public ref class ElectricityFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures
See Also
BuiltInFailures.ElectricityFailures Members
Autodesk.Revit.DB Namespace